#+title: Parsing org files

* Clock entries
  - Clock entries are found inside the ~LOGBOOK~ drawer of an item
  - They come in two formats. Examples
    #+begin_src org
      :LOGBOOK:
      CLOCK: [2025-12-16 Tue 11:09]--[2025-12-16 Tue 11:23] =>  0:14
      CLOCK: [2025-12-15 Mon 14:44]--[2025-12-15 Mon 15:31] =>  0:47
      :END:
    #+end_src
    OR
    #+begin_src org
      :LOGBOOK:
      CLOCK: [2025-12-16 Tue 11:09]--[2025-12-16 Tue 11:23] =>  0:14
      CLOCK: [2025-12-15 Mon 14:44]--[2025-12-15 Mon 15:31] =>  0:47
      :END:
    #+end_src
  - At a time only one format will be used in the file, so it's
    possible to detect the correct one and use it throughout the file.


